R12/Sample_XML_Request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns1:ItemPriceRequest xmlns:ns1="http://xmlns.irco.com/WebtopssItemPriceProvABCSImpl">
          <ControlArea>
      <PartnerCode>WEBTOPPS</PartnerCode>
      <InstanceName>WEBDEV</InstanceName>
      <RequestType>PROCESS</RequestType>
      <MessageID>E3C3E45006B0489CE0430B63560AA260</MessageID>
   </ControlArea>
   <DataArea>
      <ItemPrice>
         <ConfiguredItem>YSC060E1EMA**D000000000000000B0000000000</ConfiguredItem>
         <ProductCode>PROC_CODE</ProductCode>
         <ProductFamily>PRODUCT_FAMILY</ProductFamily>
         <PricelistName>kukrejatestPL0348224</PricelistName>
         <ListPrice>99</ListPrice>
         <UOM>EA</UOM>
         <POA>SAMPLE_POA</POA>
         <StartDate>2013-08-18T17:52:47</StartDate>
         <EndDate>2013-08-18T17:52:47</EndDate>
         <AccessoryFlag>Y</AccessoryFlag>
         <AccessoryItem>ACCESSORY_ITEM</AccessoryItem>         
         <ItemPriceFetch>
            <Header>
               <SourceHeaderRef>1876543</SourceHeaderRef>
               <OperatingUnitCode>IEOUEUR</OperatingUnitCode>
               <BusinessUnit>TFM</BusinessUnit>
               <PricingDate>2013-08-18T17:52:47</PricingDate>
               <CustomerNumber>27793</CustomerNumber>
               <SoldToSite>1234</SoldToSite>
               <CurrencyCode>USD</CurrencyCode>
               <CheckType>PRICE</CheckType>
               <Line>
                  <SourceLineRef>8765432</SourceLineRef>
                  <PartNumber>1020950</PartNumber>
                  <Quantity>1</Quantity>
                  <UOM>EACH</UOM>
                  <SupplierNumber>SUPPLIER_NAME</SupplierNumber>
                  <ManufacturingLocation>MFG_LOCATION</ManufacturingLocation>
                  <DivisionCode>DIVISION_CODE</DivisionCode>
                  <OrderType>ORDER_TYPE</OrderType>
                  <ShipmentPriority>SHIP_PRIORITY</ShipmentPriority>
                  <ShipFrom>SHIP_FROM</ShipFrom>
                  <LineCategory>LINE_CATEGORY</LineCategory>
                  <FreightTerms>FREIGHT_TERM</FreightTerms>
                  <SalesChannel>SALES_CHENNEL</SalesChannel>
                  <BillTo>12345</BillTo>
                  <OrderSource>ORDER_SOURCE</OrderSource>
                  <ModifierNumber>MODIFIER_NUMBER</ModifierNumber>
                  <PricingAttribute1>PRICING_ATTR</PricingAttribute1>
                  <ModelNumber>MODEL_NUMBER</ModelNumber>
                  <ItemType>ITEM_TYPE</ItemType>                  
               </Line>
            </Header>
         </ItemPriceFetch>
      </ItemPrice>
   </DataArea>
        </ns1:ItemPriceRequest>
    </soap:Body>
</soap:Envelope>
